Autodesk.Revit.DB.UpdaterData.GetDocument
Returns document associated with this UpdaterData
Since:
2011

Autodesk.Revit.DB.UpdaterData.IsChangeTriggered(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ChangeType)
Allows updater to check if specific change has happened to an element.
Compares input type to the types that caused Updater::execute() to be triggered.
If input type was not registered as a trigger for the associated Updater, this
method will always return false for that ChangeType.
For example, if the only trigger registered for UpdaterX is ChangeTypeAny for Element A,
then passing in ChangeTypeGeometry will return false even if the geometry of A changed because
the registered trigger was ChangeTypeAny. However, passing in ChangeTypeAny will return true.
id:
Id of element to check
type:
ChangeType to check
Returns:
True if ChangeType happened to specified element
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.UpdaterData.GetModifiedElementIds
Returns set of elements that were modified.
This set is mutually exclusive of elements returned by getAddedElementIds() and getDeletedElementIds().
Returns:
Set of elements that were modified in the document and triggered the call to execute()
Note: This set only contains modified elements (i.e. it is mutually exclusive of elements returned
by getAddedElementIds() and getDeletedElementIds()). It does not contain any elements that were
added to or deleted from the document during the current transaction.
Newly added/deleted elements will be reported by getAddedElementIds()/getDeletedElementIds(),
even if they were also modified during the same transaction, but only if ChangeTypeElementAddition/Deletion
is registered as a trigger for the current Updater. I.e. Element creation and modification in
the same transaction is considered to be "creation" only. Newly created elements are not considered to be
"modified" and are therefore not returned as part of getModifiedElementIds()
Since:
2011

Autodesk.Revit.DB.UpdaterData.GetDeletedElementIds
Returns set of elements that were deleted from the document.
This set is mutually exclusive of elements returned by getAddedElementIds() and getModifiedElementIds().
Returns:
Set of elements that were deleted from the document and triggered the call to execute()
Note: This will only return elements if the trigger registered for the associated updater
contains the ChangeType returned by Element::getChangeTypeElementDeletion()
Since:
2011

Autodesk.Revit.DB.UpdaterData.GetAddedElementIds
Returns set of elements newly added to the document.
This set is mutually exclusive of elements returned by getDeletedElementIds() and getModifiedElementIds().
Returns:
Set of elements that were added to the document and triggered the call to execute()
Note: This will only return elements if the trigger registered for the associated updater
contains the ChangeType returned by Element::getChangeTypeElementAddition()
Since:
2011

Autodesk.Revit.DB.UpdaterData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.UpdaterData
Service class that is passed to an Updater to prove access to update execution context
Since:
2011